Файлы_конфигурации/Documents/ПриходноКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПриходноКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.РезервированиеТовара</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервированиеТоваров</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТовара</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИВремяНачалаОказанияУслуги</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьОказанияУслуги</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИВремяОкончанияОказанияУслуги</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЕдиницыИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Файлы_конфигурации/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Файлы_конфигурации/Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Файлы_конфигурации/Documents/ПриходноКассовыйОрдер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);	

КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаИВремяНачалаОказанияУслугиПриИзменении(Элемент)

	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
	РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиДлительностьОказанияУслугиПриИзменении(Элемент)

	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
    РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаИВремяОкончанияОказанияУслугиПриИзменении(Элемент)
	
	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
    РаботаСТабличнымиЧастямиДокументов.ПересчетСуммы(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Склад = Тренерская();
	Сообщить("Для просмотра Суммы используйте горизонтальную полосу прокрутки.");

КонецПроцедуры

&НаСервереБезКонтекста
Функция Тренерская()
    Возврат Справочники.Склады.Тренерская;    
КонецФункции //Тренерская


&НаКлиенте
Процедура УслугиНаименованиеУслугиПриИзменении(Элемент)
	
	ТекСтрока                                = Элементы.Услуги.ТекущиеДанные;	
	ТекСтрока.ДатаИВремяНачалаОказанияУслуги = ТекущаяДата();
	ТекСтрока.ДлительностьОказанияУслуги     = Дата('00010101010000');
	РаботаСТабличнымиЧастямиДокументов.ПересчетДатыИВремениОкончанияОказанияУслуги(Элементы.Услуги.ТекущиеДанные);
	Объект.СуммаДокумента                    = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки)
	
	
	ФизическоеЛицо = Справочники.Контрагенты.ФизическоеЛицо;
	Запрос1        = Новый Запрос;
	Запрос1.Текст  = 
					"ВЫБРАТЬ
					|	Договоры.ВидЦены КАК ВидЦены
					|ИЗ
					|	Справочник.Договоры КАК Договоры
					|ГДЕ
					|	Договоры.Владелец = &Владелец";
	Запрос1.УстановитьПараметр("Владелец", ФизическоеЛицо);
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	Если РезультатЗапроса1.Пустой() Тогда
		 ВидЦен           = 0;
		 ЦенаНоменклатуры = 0;
	Иначе
		 РезультатЗапроса1 = РезультатЗапроса1.Выгрузить();
		 ВидЦен            = РезультатЗапроса1[0].ВидЦены;

		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаДокумента,
		|			Номенклатура = &НоменклатураИзСтроки
		|				И Организация = &ОрганизацияИзСтроки
		|				И ЕдиницаИзмерения = &ЕдиницаИзмеренияИзСтроки
		|				И ВариантНоменклатуры = &ВариантНоменклатурыИзСтроки
		|				И ВидЦены = &ВидЦеныИзСтроки) КАК ЦеныНоменклатурыСрезПоследних";
		Запрос.УстановитьПараметр("ДатаДокумента"              , СтруктураСтроки.Дата);
		Запрос.УстановитьПараметр("НоменклатураИзСтроки"       , СтруктураСтроки.Номенклатура);
		Запрос.УстановитьПараметр("ОрганизацияИзСтроки"        , СтруктураСтроки.Организация);
		Запрос.УстановитьПараметр("ЕдиницаИзмеренияИзСтроки"   , СтруктураСтроки.ЕдиницыИзмерения);
		Запрос.УстановитьПараметр("ВариантНоменклатурыИзСтроки", СтруктураСтроки.НаборСвойств);
		Запрос.УстановитьПараметр("ВидЦеныИзСтроки"            , ВидЦен);
									
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			 ЦенаНоменклатуры = 0;
		Иначе
			 РезультатЗапроса = РезультатЗапроса.Выгрузить();
			 ЦенаНоменклатуры = РезультатЗапроса[0].Цена;
		КонецЕсли;
	
	КонецЕсли;
	
	СтруктураССервера = Новый Структура(); 
	СтруктураССервера.Вставить("ЦенаНоменклатуры",ЦенаНоменклатуры);
	СтруктураССервера.Вставить("КоэффициентЕдиницыИзмерения",СтруктураСтроки.ЕдиницыИзмерения.КоэффициентЕдиницыИзмерения);

	Возврат СтруктураССервера;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЕдИзмПриИзменении(Элемент)
	
	 ТекСтрока = Элементы.Таблица.ТекущиеДанные;
	 
	 Если ПустаяСтрока(ТекСтрока.НаборСвойств) Тогда
		 Сообщить("Не заполнена колонка <<Набор свойств>> в строке № " + ТекСтрока.НомерСтроки + " таблицы");
		 Возврат;
	 КонецЕсли;
	
	
	 СтруктураСтроки = Новый Структура();
	 СтруктураСтроки.Вставить("Номенклатура"    ,ТекСтрока.Номенклатура);
	 СтруктураСтроки.Вставить("НаборСвойств"    ,ТекСтрока.НаборСвойств);
	 СтруктураСтроки.Вставить("ЕдиницыИзмерения",ТекСтрока.ЕдИзм);
	 СтруктураСтроки.Вставить("Дата"            ,Объект.Дата);
	 СтруктураСтроки.Вставить("Организация"     ,Объект.Организация);
	 	
	 СтруктураССервера = ТаблицаЕдиницыИзмеренияПриИзмененииНаСервере(СтруктураСтроки);
	
	 ТекСтрока.Цена    = СтруктураССервера.ЦенаНоменклатуры;
	
	 Если СтруктураССервера.ЦенаНоменклатуры = 0 Тогда
		  Сообщить("В регистре отсутствует цена на номенклатуру <<"+ТекСтрока.Номенклатура+">> со свойствами <<"+ТекСтрока.НаборСвойств+">>, ед.изм. <<"+ ТекСтрока.ЕдИзм+">>");
	 КонецЕсли;
	
	 ТекСтрока.КоэффициентЕдиницыИзмерения = СтруктураССервера.КоэффициентЕдиницыИзмерения;
	 
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНаборСвойствПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма")+Объект.Услуги.Итог("Сумма");

	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЕдИзмКоэффициентЕдиницыИзмеренияПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Количество  = 0;
	 ТекСтрока.Цена        = 0;
	 ТекСтрока.Сумма       = 0;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКоличествоПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦенаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСуммаПриИзменении(Элемент)
	
	 ТекСтрока             = Элементы.Таблица.ТекущиеДанные;
	 ТекСтрока.Сумма       = ТекСтрока.Цена*ТекСтрока.Количество;
	 Объект.СуммаДокумента = Объект.Таблица.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры
